Ran Plan for project: `data-platform` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.data_engineering_environments["config/data_engineering/bi"].astro_deployment.dev_deployment[0] will be created
+ resource "astro_deployment" "dev_deployment" {
      + airflow_version             = (known after apply)
      + astro_runtime_version       = (known after apply)
      + cloud_provider              = (known after apply)
      + cluster_id                  = "clsnqbuxm04yl01mjwn979vz8"
      + contact_emails              = [
          + "bas@astronomer.io",
        ]
      + created_at                  = (known after apply)
      + created_by                  = (known after apply)
      + dag_tarball_version         = (known after apply)
      + default_task_pod_cpu        = "0.25"
      + default_task_pod_memory     = "0.5Gi"
      + description                 = "Development Deployment"
      + desired_dag_tarball_version = (known after apply)
      + environment_variables       = []
      + executor                    = "CELERY"
      + external_ips                = (known after apply)
      + id                          = (known after apply)
      + image_repository            = (known after apply)
      + image_tag                   = (known after apply)
      + image_version               = (known after apply)
      + is_cicd_enforced            = false
      + is_dag_deploy_enabled       = true
      + is_development_mode         = true
      + is_high_availability        = false
      + name                        = "Development"
      + namespace                   = (known after apply)
      + oidc_issuer_url             = (known after apply)
      + region                      = (known after apply)
      + resource_quota_cpu          = "10"
      + resource_quota_memory       = "20Gi"
      + scaling_status              = (known after apply)
      + scheduler_cpu               = (known after apply)
      + scheduler_memory            = (known after apply)
      + scheduler_replicas          = (known after apply)
      + scheduler_size              = "SMALL"
      + status                      = (known after apply)
      + status_reason               = (known after apply)
      + type                        = "DEDICATED"
      + updated_at                  = (known after apply)
      + updated_by                  = (known after apply)
      + webserver_airflow_api_url   = (known after apply)
      + webserver_ingress_hostname  = (known after apply)
      + webserver_url               = (known after apply)
      + worker_queues               = [
          + {
              + astro_machine      = "A5"
              + is_default         = true
              + max_worker_count   = 10
              + min_worker_count   = 0
              + name               = "default"
              + pod_cpu            = (known after apply)
              + pod_memory         = (known after apply)
              + worker_concurrency = 5
            },
        ]
      + workload_identity           = (known after apply)
      + workspace_id                = (known after apply)
    }

  # module.data_engineering_environments["config/data_engineering/bi"].astro_workspace.astro_workspace will be created
+ resource "astro_workspace" "astro_workspace" {
      + cicd_enforced_default = false
      + created_at            = (known after apply)
      + created_by            = (known after apply)
      + description           = "TF demo - Workspace for team bi"
      + id                    = (known after apply)
      + name                  = "TF demo - Team bi"
      + updated_at            = (known after apply)
      + updated_by            = (known after apply)
    }

  # module.data_engineering_environments["config/data_engineering/business_intelligence"].astro_deployment.dev_deployment[0] will be created
+ resource "astro_deployment" "dev_deployment" {
      + airflow_version             = (known after apply)
      + astro_runtime_version       = (known after apply)
      + cloud_provider              = (known after apply)
      + cluster_id                  = "clsnqbuxm04yl01mjwn979vz8"
      + contact_emails              = [
          + "bas@astronomer.io",
        ]
      + created_at                  = (known after apply)
      + created_by                  = (known after apply)
      + dag_tarball_version         = (known after apply)
      + default_task_pod_cpu        = "0.25"
      + default_task_pod_memory     = "0.5Gi"
      + description                 = "Development Deployment"
      + desired_dag_tarball_version = (known after apply)
      + environment_variables       = []
      + executor                    = "CELERY"
      + external_ips                = (known after apply)
      + id                          = (known after apply)
      + image_repository            = (known after apply)
      + image_tag                   = (known after apply)
      + image_version               = (known after apply)
      + is_cicd_enforced            = false
      + is_dag_deploy_enabled       = true
      + is_development_mode         = true
      + is_high_availability        = false
      + name                        = "Development"
      + namespace                   = (known after apply)
      + oidc_issuer_url             = (known after apply)
      + region                      = (known after apply)
      + resource_quota_cpu          = "10"
      + resource_quota_memory       = "20Gi"
      + scaling_status              = (known after apply)
      + scheduler_cpu               = (known after apply)
      + scheduler_memory            = (known after apply)
      + scheduler_replicas          = (known after apply)
      + scheduler_size              = "SMALL"
      + status                      = (known after apply)
      + status_reason               = (known after apply)
      + type                        = "DEDICATED"
      + updated_at                  = (known after apply)
      + updated_by                  = (known after apply)
      + webserver_airflow_api_url   = (known after apply)
      + webserver_ingress_hostname  = (known after apply)
      + webserver_url               = (known after apply)
      + worker_queues               = [
          + {
              + astro_machine      = "A5"
              + is_default         = true
              + max_worker_count   = 10
              + min_worker_count   = 0
              + name               = "default"
              + pod_cpu            = (known after apply)
              + pod_memory         = (known after apply)
              + worker_concurrency = 5
            },
        ]
      + workload_identity           = (known after apply)
      + workspace_id                = (known after apply)
    }

  # module.data_engineering_environments["config/data_engineering/business_intelligence"].astro_workspace.astro_workspace will be created
+ resource "astro_workspace" "astro_workspace" {
      + cicd_enforced_default = false
      + created_at            = (known after apply)
      + created_by            = (known after apply)
      + description           = "TF demo - Workspace for team business intelligence"
      + id                    = (known after apply)
      + name                  = "TF demo - Team business intelligence"
      + updated_at            = (known after apply)
      + updated_by            = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p data-platform
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://0bdc-31-223-164-113.ngrok-free.app/lock?id=astronomer%252Fastronomer-data-platform-demo%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p data-platform
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```